import numpy as np # імпортуємо бібліотеку numpy для роботи з масивами

print("\ntask1_Proc13\n") # виводимо назву задачі

def SortDec3(A, B, C):
  """Сортуємо A, B, C за зменшенням"""
  lst = sorted([A, B, C], reverse=True) # створюємо список з A, B, C та сортуємо його у зворотному порядку
  return lst[0], lst[1], lst[2] # повертаємо перший, другий та третій елементи списку

def Proc13():
  """Сортуємо два набори з трьох чисел за спаданням"""
  A1, B1, C1 = map(int, input("\nВведіть три числа для першого набору (через пропуск): ").split()) # зчитуємо три числа для першого набору і перетворюємо їх на цілі
  A2, B2, C2 = map(int, input("\nВведіть три числа для другого набору (через пропуск): ").split()) # зчитуємо три числа для другого набору і перетворюємо їх на цілі
  A1, B1, C1 = SortDec3(A1, B1, C1) # сортуємо перший набір за спаданням
  A2, B2, C2 = SortDec3(A2, B2, C2) # сортуємо другий набір за спаданням
  print(f"\nПерший набір, відсортований за зменшенням: {A1}, {B1}, {C1} ") # виводимо перший набір
  print(f"Другий набір, відсортований за зменшенням: {A2}, {B2}, {C2} \n") # виводимо другий набір
Proc13() # Викликаємо функцію Proc13


print("\ntask2_Matrix18\n") # виводимо назву задачі

def Matrix18(matrix):
    """Знаходимо кількість стовпців з різними елементами і додаємо до матриці рядків M з випадковими числами"""
    M, N = matrix.shape # отримуємо розміри матриці
    unique_cols = sum(1 for col in matrix.T if len(set(col)) == len(col)) # вважаємо кількість стовпців, у яких всі елементи різні
    print(f"\nКількість стовпців з різними елементами: {unique_cols} \n") # виводимо результат
    random_rows = np.random.randint(1, 100, size=(M, N)) # створюємо M рядків із випадковими числами від 1 до 100
    new_matrix = np.concatenate([matrix, random_rows], axis=0) # об'єднуємо вихідну матрицю та нові рядки по вертикалі
    print("Нова матриця після додавання випадкових рядків: \n") # виводимо повідомлення
    print(new_matrix) # виводимо нову матрицю

if __name__ == "__main__":
    M = 5
    N = 5
    matrix = np.random.randint(1, 100, size=(M, N)) # створюємо матрицю з випадкових чисел від 1 до 100
    Matrix18(matrix) # Викликаємо функцію Matrix18
